; domain
(define (domain healthcare_facility_2_base)
    (:requirements :strips :typing :equality)

    (:types
        location carrier - object
        worker_bot helper_bot - robot
        med_unit robot box supply patient - locatable
    )

    (:predicates
        ; location related
        (at ?obj - locatable ?loc - location) ; locatable is at a location
        (linked ?loc1 - location ?loc2 - location) ; two locations are linked (roadmap)
        
        ; General Robot related
        (bot_is_free ?bot - robot) ; bot is free (not carrying a box or helping a patient)
        
        ; Worker bots
        (bot_owns_carrier ?bot - robot ?carr - carrier) ; a bot owns a carrier
        
        ; Helper bots
        (helping_patient ?bot - helper_bot ?pat - patient) ; helper bot is helping the patient

        ; Carrier related
        (carrying_box ?carr - carrier ?obj - box) ; carrier has the box loaded
        (carrier_can_1 ?carr - carrier)  ; carrier can hold box 1
        (carrier_can_2 ?carr - carrier)   ; carrier can hold box 2   
        (carrier_can_3 ?carr - carrier)  ; carrier can hold box 3 (maximum)
        ; Carrier capacity settings
        (carrier_empty ?carr - carrier) ; carrier has 0 boxes
        (carrier_has_1 ?carr - carrier); carrier has 1 box
        (carrier_has_2 ?carr - carrier) ; carrier has 2 boxes
        (carrier_has_3 ?carr - carrier) ; carrier has 3 boxes (maximum)
        
        ; Box related
        (box_is_empty ?box - box) ; box is empty
        (box_on_ground ?box - box) ; box is on the ground (not being carried by a bot)

        ; Patient related
        (patient_on_ground ?pat - patient) ; patient is on the ground (not being helped)

        ; Supply related
        (supply_in_box ?sup - supply ?box - box) ; supply is in a box
        
        ; Goal Oriented
        (needs_supply ?mu - med_unit ?sup - supply) ; medical unit needs a supply
        (needs_patient ?mu - med_unit ?pat - patient) ; medical unit needs a patient so he they can treat them
        (has_supply ?mu - med_unit ?sup - supply) ; medical unit has a supply
        (has_patient ?mu - med_unit ?pat - patient) ; medical unit has a patient
    )

    ;;
    ;; Move Actions
    ;;
    
    (:action move_bot_alone
        :parameters (?bot - robot ?from - location ?to - location)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; the bot is free (carrier is empty / not helping a patient)
            (bot_is_free ?bot)
        )
        :effect (and
            ; change location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
        )
    )
    
    (:action move_worker_bot_with_1_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box ?from - location ?to - location)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; carrier checks
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_1 ?carr) ; the bot carries a single box
            (carrying_box ?carr ?box) ; carrying one box
        )
        :effect (and
            ; update location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
            ; update location (box)
            (not (at ?box ?from))
            (at ?box ?to)
        )
    )
    
    (:action move_worker_bot_with_2_boxes
        :parameters (?bot - worker_bot ?carr - carrier ?box1 - box ?box2 - box ?from - location ?to - location)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; carrier is owned by the bot and has capacity for 2 boxes
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_2 ?carr)
            ; both boxes are on the carrier
            (carrying_box ?carr ?box1)
            (carrying_box ?carr ?box2)
            ; boxes must be different
            (not (= ?box1 ?box2))
        )
        :effect (and
            ; update location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
            ; update location of both boxes
            (not (at ?box1 ?from))
            (at ?box1 ?to)
            (not (at ?box2 ?from))
            (at ?box2 ?to)
        )
    )

    (:action move_worker_bot_with_3_boxes
        :parameters (?bot - worker_bot ?carr - carrier ?box1 - box ?box2 - box  ?box3 - box  ?from - location ?to - location)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; carrier is owned by the bot and has capacity for 3 boxes
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_3 ?carr)
            ; all three boxes are on the carrier
            (carrying_box ?carr ?box1)
            (carrying_box ?carr ?box2)
            (carrying_box ?carr ?box3)
            ; boxes must be different
            (not (= ?box1 ?box2))
            (not (= ?box1 ?box3))
            (not (= ?box2 ?box3))
        )
        :effect (and
            ; update location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
            ; update location of all three boxes
            (not (at ?box1 ?from))
            (at ?box1 ?to)
            (not (at ?box2 ?from))
            (at ?box2 ?to)
            (not (at ?box3 ?from))
            (at ?box3 ?to)
        )
    )

    (:action move_helper_bot_patient
        :parameters (?bot - helper_bot ?from - location ?to - location ?pat - patient)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; helper bot is helping a patient
            (helping_patient ?bot ?pat)
        )
        :effect (and
            ; update location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
            ; update location (patient)
            (not (at ?pat ?from))
            (at ?pat ?to)
        )
    )
    

    ;;
    ;; Worker Bots : These are the bots that carry boxes with supplies  
    ;;

    ; pick up first box when carrier is empty (0 -> 1)
    (:action pick_up_1st_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?box ?loc)
            ; box not being carried
            (box_on_ground ?box)
            ; carrier has space
            (bot_owns_carrier ?bot ?carr)
            (carrier_empty ?carr)
            (carrier_can_1 ?carr)
        )
        :effect (and
            ; robot now has the box
            (carrying_box ?carr ?box)
            (not (box_on_ground ?box))
            ; update carrier capacity
            (not (carrier_empty ?carr))
            (carrier_has_1 ?carr)
            ; bot becomes busy
            (not (bot_is_free ?bot))
        )
    )

    ; pick up second box when carrier has one (1 -> 2)
    (:action pick_up_2nd_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?box ?loc)
            ; box not being carried
            (box_on_ground ?box)
            ; carrier has space
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_1 ?carr) ; one box is already being carried
            (carrier_can_2 ?carr) ; carrier must have capacity for 2 boxes
        )
        :effect (and
            ; robot now has the box
            (carrying_box ?carr ?box)
            (not (box_on_ground ?box))
            ; update carrier capacity
            (not (carrier_has_1 ?carr))
            (carrier_has_2 ?carr)
        )
    )

    ; pick up third box when carrier has two (2 -> 3)
    (:action pick_up_3rd_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?box ?loc)
            ; box not being carried
            (box_on_ground ?box)
            ; carrier has space
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_2 ?carr) ; two boxes are already being carried
            (carrier_can_3 ?carr) ; carrier must have capacity for 3 boxes
        )
        :effect (and
            ; robot now has the box
            (carrying_box ?carr ?box)
            (not (box_on_ground ?box))
            ; update carrier capacity
            (not (carrier_has_2 ?carr))
            (carrier_has_3 ?carr)
        )
    )

    ; drop down a box when carrier is full (3 -> 2)
    (:action drop_down_3rd_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box)
        :precondition (and
            ; the bot carries the box
            (carrying_box ?carr ?box)
            ; bot owns the carrier
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_3 ?carr) ; carrier has 3 boxes on (maximum capacity)
        )
        :effect (and
            ; leave box there
            (not (carrying_box ?carr ?box))
            (box_on_ground ?box)
            ; update carrier capacity
            (not (carrier_has_3 ?carr))
            (carrier_has_2 ?carr)
        )
    )

    ; drop down a box when carrier has two boxes (2 -> 1)
    (:action drop_down_2nd_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box)
        :precondition (and
            ; the bot carries the box
            (carrying_box ?carr ?box)
            ; bot owns the carrier
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_2 ?carr) ; carrier has 2 boxes on
        )
        :effect (and
            ; leave box there
            (not (carrying_box ?carr ?box))
            (box_on_ground ?box)
            ; update carrier capacity
            (not (carrier_has_2 ?carr))
            (carrier_has_1 ?carr)
        )
    )

    ; drop down a box when carrier has 1 boxes (1 -> 0)
    (:action drop_down_1st_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box)
        :precondition (and
            ; the bot carries the box
            (carrying_box ?carr ?box)
            ; bot owns the carrier
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_1 ?carr)
        )
        :effect (and
            ; leave box there
            (not (carrying_box ?carr ?box))
            (box_on_ground ?box)
            ; update carrier capacity
            (not (carrier_has_1 ?carr))
            (carrier_empty ?carr) ; carrier is now empty
            ; robot is once again free
            (bot_is_free ?bot)
        )
    )


    (:action fill_box
        :parameters (?bot - worker_bot ?box - box ?sup - supply ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?sup ?loc)
            (at ?box ?loc)
            ; the box is not being carried
            (box_on_ground ?box)
            ; box must be empty
            (box_is_empty ?box)
        )
        :effect (and
            ; fill the box with the supply
            (supply_in_box ?sup ?box)
            (not (box_is_empty ?box))
        )
    )


    (:action deliver_supply
        :parameters (?bot - worker_bot ?box - box ?sup - supply ?loc - location ?mu - med_unit)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?mu ?loc)
            (at ?box ?loc)
            ; the box is NOT being carried
            (box_on_ground ?box)
            ; the supply is in the box
            (supply_in_box ?sup ?box)
            ; the medical unit needs such supply
            (needs_supply ?mu ?sup)
        )
        :effect (and
            ; empty the box
            (not (supply_in_box ?sup ?box))
            (box_is_empty ?box)
            ; satisfy the medical unit's need and hand over the supply
            (not (needs_supply ?mu ?sup)) 
            (has_supply ?mu ?sup)
        )
    )

    ;;
    ;; Helper Bots : These are the bots that accompany patients to medical units
    ;;

    (:action pick_up_patient
        :parameters (?bot - helper_bot ?pat - patient ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?pat ?loc)
            ; patient is not being helped by some other bot
            (patient_on_ground ?pat)
            ; helper bot is free
            (bot_is_free ?bot)
        )
        :effect (and
            ; helper bot accompanies the patient
            (helping_patient ?bot ?pat)
            (not (patient_on_ground ?pat))
            ; helper bot is now busy
            (not (bot_is_free ?bot))
        )
    )
    (:action drop_down_patient
        :parameters (?bot - helper_bot ?pat - patient)
        :precondition (and
            ; helper bot accompanies the patient
            (helping_patient ?bot ?pat)
        )
        :effect (and
            ; helper bot no longer accompanies the patient
            (not (helping_patient ?bot ?pat))
            (patient_on_ground ?pat)
            ; helper bot is no longer busy
            (bot_is_free ?bot)
        )
    )
    (:action deliver_patient
        :parameters (?bot - helper_bot ?pat - patient ?mu - med_unit ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?mu ?loc)
            (at ?pat ?loc)
            ; the patient is not being helped by some other bot
            (patient_on_ground ?pat) 
            ; the patient needs treatment at the medical unit
            (needs_patient ?mu ?pat)
        )
        :effect (and
            ; satisfy the medical unit's need for the patient and hand over the patient
            (not (needs_patient ?mu ?pat))
            (has_patient ?mu ?pat)
        )
    )
)

; problem
(define (problem healthcare_facility_2_base_hard)
    (:domain healthcare_facility_2_base)

    (:objects 
        ;; Locations
        entrance reception diagnostic_lab corridor1 corridor2 central_warehouse
        surgical_block emergency_room cardiology_ward neurology_ward
        - location

        ;; Robots - 2 worker bots and 2 helper bots
        wBot1 wBot2 - worker_bot
        hBot1 hBot2 - helper_bot

        ;; Carriers - different capacities
        carrier1 carrier2 - carrier

        ;; Boxes - 4 boxes for 5 supply deliveries
        box1 box2 box3 box4 - box

        ;; Supplies - 5 different supplies
        scalpel defibrillator stethoscope blood_bag surgical_mask - supply

        ;; Medical Units
        trauma_unit resuscitation_unit triage_unit operation_unit cardiology_unit neurology_unit - med_unit

        ;; Patients - 3 patients for 3 deliveries
        patient1 patient2 patient3 - patient
    )

    (:init
        ;; Roadmap - same as original
        (linked entrance reception)
        (linked reception entrance)

        (linked reception emergency_room)
        (linked emergency_room reception)

        (linked emergency_room corridor2)
        (linked corridor2 emergency_room)

        (linked corridor2 diagnostic_lab)
        (linked diagnostic_lab corridor2)

        (linked corridor1 diagnostic_lab)
        (linked diagnostic_lab corridor1)
        
        (linked surgical_block corridor1)
        (linked corridor1 surgical_block)

        (linked corridor1 central_warehouse)
        (linked central_warehouse corridor1)

        (linked reception corridor1)
        (linked corridor1 reception)

        (linked diagnostic_lab neurology_ward)
        (linked neurology_ward diagnostic_lab)

        (linked surgical_block cardiology_ward)
        (linked cardiology_ward surgical_block)

        ;; Carrier setup - different capacities
        (bot_owns_carrier wBot1 carrier1)
        (bot_owns_carrier wBot2 carrier2)
        
        ;; Carrier 1 - capacity 3
        (carrier_empty carrier1)
        (carrier_can_1 carrier1) (carrier_can_2 carrier1) (carrier_can_3 carrier1)
        
        ;; Carrier 2 - capacity 2
        (carrier_empty carrier2)
        (carrier_can_1 carrier2) (carrier_can_2 carrier2)

        ;; Medical unit locations - same as simple version
        (at trauma_unit emergency_room)
        (at resuscitation_unit emergency_room)
        (at triage_unit reception)
        (at operation_unit surgical_block)
        (at cardiology_unit cardiology_ward)
        (at neurology_unit neurology_ward)

        ;; Robot initial positions
        (at wBot1 central_warehouse)
        (at wBot2 central_warehouse)
        (at hBot1 entrance)
        (at hBot2 entrance)
        
        ;; All bots are free initially
        (bot_is_free wBot1)
        (bot_is_free wBot2)
        (bot_is_free hBot1)
        (bot_is_free hBot2)

        ;; All boxes at central_warehouse, empty, on ground
        (at box1 central_warehouse) (box_is_empty box1) (box_on_ground box1)
        (at box2 central_warehouse) (box_is_empty box2) (box_on_ground box2)
        (at box3 central_warehouse) (box_is_empty box3) (box_on_ground box3)
        (at box4 central_warehouse) (box_is_empty box4) (box_on_ground box4)

        ;; All supplies at central_warehouse
        (at scalpel central_warehouse)
        (at defibrillator central_warehouse)
        (at stethoscope central_warehouse)
        (at blood_bag central_warehouse)
        (at surgical_mask central_warehouse)

        ;; Patients at different locations, not being helped
        (at patient1 entrance) (patient_on_ground patient1)
        (at patient2 entrance) (patient_on_ground patient2)
        (at patient3 diagnostic_lab) (patient_on_ground patient3)

        ;; Medical unit needs - 5 supply deliveries
        (needs_supply trauma_unit scalpel)
        (needs_supply resuscitation_unit defibrillator)
        (needs_supply cardiology_unit stethoscope)
        (needs_supply neurology_unit blood_bag)
        (needs_supply triage_unit surgical_mask)
        
        ;; Patient needs - 3 patient deliveries
        (needs_patient operation_unit patient1)
        (needs_patient cardiology_unit patient2)
        (needs_patient neurology_unit patient3)
    )

    (:goal
        (and
            ;; Satisfy all 5 supply needs
            (has_supply trauma_unit scalpel)
            (has_supply resuscitation_unit defibrillator)
            (has_supply cardiology_unit stethoscope)
            (has_supply neurology_unit blood_bag)
            (has_supply triage_unit surgical_mask)
            
            ;; Satisfy all 3 patient needs
            (has_patient operation_unit patient1)
            (has_patient cardiology_unit patient2)
            (has_patient neurology_unit patient3)
        )
    )
)

; plan
1. (fill_box wbot1 box4 blood_bag central_warehouse)
   deleted: (box_is_empty box4)
   added: (supply_in_box blood_bag box4)
   goals met: 0 of 8
2. (fill_box wbot1 box3 defibrillator central_warehouse)
   deleted: (box_is_empty box3)
   added: (supply_in_box defibrillator box3)
   goals met: 0 of 8
3. (fill_box wbot1 box2 scalpel central_warehouse)
   deleted: (box_is_empty box2)
   added: (supply_in_box scalpel box2)
   goals met: 0 of 8
4. (fill_box wbot1 box1 surgical_mask central_warehouse)
   deleted: (box_is_empty box1)
   added: (supply_in_box surgical_mask box1)
   goals met: 0 of 8
5. (move_bot_alone hbot1 entrance reception)
   deleted: (at hbot1 entrance)
   added: (at hbot1 reception)
   goals met: 0 of 8
6. (move_bot_alone hbot1 reception corridor1)
   deleted: (at hbot1 reception)
   added: (at hbot1 corridor1)
   goals met: 0 of 8
7. (move_bot_alone hbot1 corridor1 diagnostic_lab)
   deleted: (at hbot1 corridor1)
   added: (at hbot1 diagnostic_lab)
   goals met: 0 of 8
8. (pick_up_patient hbot1 patient3 diagnostic_lab)
   deleted: (patient_on_ground patient3) (bot_is_free hbot1)
   added: (helping_patient hbot1 patient3)
   goals met: 0 of 8
9. (move_helper_bot_patient hbot1 diagnostic_lab neurology_ward patient3)
   deleted: (at hbot1 diagnostic_lab) (at patient3 diagnostic_lab)
   added: (at hbot1 neurology_ward) (at patient3 neurology_ward)
   goals met: 0 of 8
10. (drop_down_patient hbot1 patient3)
   deleted: (helping_patient hbot1 patient3)
   added: (patient_on_ground patient3) (bot_is_free hbot1)
   goals met: 0 of 8
11. (deliver_patient hbot1 patient3 neurology_unit neurology_ward)
   deleted: (needs_patient neurology_unit patient3)
   added: (has_patient neurology_unit patient3)
   goals met: 1 of 8
12. (pick_up_patient hbot2 patient1 entrance)
   deleted: (patient_on_ground patient1) (bot_is_free hbot2)
   added: (helping_patient hbot2 patient1)
   goals met: 1 of 8
13. (move_helper_bot_patient hbot2 entrance reception patient1)
   deleted: (at hbot2 entrance) (at patient1 entrance)
   added: (at hbot2 reception) (at patient1 reception)
   goals met: 1 of 8
14. (move_helper_bot_patient hbot2 reception corridor1 patient1)
   deleted: (at hbot2 reception) (at patient1 reception)
   added: (at hbot2 corridor1) (at patient1 corridor1)
   goals met: 1 of 8
15. (move_helper_bot_patient hbot2 corridor1 surgical_block patient1)
   deleted: (at hbot2 corridor1) (at patient1 corridor1)
   added: (at hbot2 surgical_block) (at patient1 surgical_block)
   goals met: 1 of 8
16. (drop_down_patient hbot2 patient1)
   deleted: (helping_patient hbot2 patient1)
   added: (patient_on_ground patient1) (bot_is_free hbot2)
   goals met: 1 of 8
17. (deliver_patient hbot2 patient1 operation_unit surgical_block)
   deleted: (needs_patient operation_unit patient1)
   added: (has_patient operation_unit patient1)
   goals met: 2 of 8
18. (pick_up_1st_box wbot1 carrier1 box1 central_warehouse)
   deleted: (box_on_ground box1) (carrier_empty carrier1) (bot_is_free wbot1)
   added: (carrying_box carrier1 box1) (carrier_has_1 carrier1)
   goals met: 2 of 8
19. (pick_up_1st_box wbot2 carrier2 box4 central_warehouse)
   deleted: (box_on_ground box4) (carrier_empty carrier2) (bot_is_free wbot2)
   added: (carrying_box carrier2 box4) (carrier_has_1 carrier2)
   goals met: 2 of 8
20. (move_worker_bot_with_1_box wbot2 carrier2 box4 central_warehouse corridor1)
   deleted: (at wbot2 central_warehouse) (at box4 central_warehouse)
   added: (at wbot2 corridor1) (at box4 corridor1)
   goals met: 2 of 8
21. (move_worker_bot_with_1_box wbot2 carrier2 box4 corridor1 diagnostic_lab)
   deleted: (at wbot2 corridor1) (at box4 corridor1)
   added: (at wbot2 diagnostic_lab) (at box4 diagnostic_lab)
   goals met: 2 of 8
22. (move_worker_bot_with_1_box wbot2 carrier2 box4 diagnostic_lab neurology_ward)
   deleted: (at wbot2 diagnostic_lab) (at box4 diagnostic_lab)
   added: (at wbot2 neurology_ward) (at box4 neurology_ward)
   goals met: 2 of 8
23. (drop_down_1st_box wbot2 carrier2 box4)
   deleted: (carrying_box carrier2 box4) (carrier_has_1 carrier2)
   added: (box_on_ground box4) (carrier_empty carrier2) (bot_is_free wbot2)
   goals met: 2 of 8
24. (pick_up_2nd_box wbot1 carrier1 box2 central_warehouse)
   deleted: (box_on_ground box2) (carrier_has_1 carrier1)
   added: (carrying_box carrier1 box2) (carrier_has_2 carrier1)
   goals met: 2 of 8
25. (pick_up_3rd_box wbot1 carrier1 box3 central_warehouse)
   deleted: (box_on_ground box3) (carrier_has_2 carrier1)
   added: (carrying_box carrier1 box3) (carrier_has_3 carrier1)
   goals met: 2 of 8
26. (move_bot_alone hbot1 neurology_ward diagnostic_lab)
   deleted: (at hbot1 neurology_ward)
   added: (at hbot1 diagnostic_lab)
   goals met: 2 of 8
27. (move_bot_alone hbot2 surgical_block cardiology_ward)
   deleted: (at hbot2 surgical_block)
   added: (at hbot2 cardiology_ward)
   goals met: 2 of 8
28. (move_bot_alone hbot1 diagnostic_lab corridor1)
   deleted: (at hbot1 diagnostic_lab)
   added: (at hbot1 corridor1)
   goals met: 2 of 8
29. (move_bot_alone hbot1 corridor1 reception)
   deleted: (at hbot1 corridor1)
   added: (at hbot1 reception)
   goals met: 2 of 8
30. (move_bot_alone hbot1 reception entrance)
   deleted: (at hbot1 reception)
   added: (at hbot1 entrance)
   goals met: 2 of 8
31. (pick_up_patient hbot1 patient2 entrance)
   deleted: (patient_on_ground patient2) (bot_is_free hbot1)
   added: (helping_patient hbot1 patient2)
   goals met: 2 of 8
32. (move_helper_bot_patient hbot1 entrance reception patient2)
   deleted: (at hbot1 entrance) (at patient2 entrance)
   added: (at hbot1 reception) (at patient2 reception)
   goals met: 2 of 8
33. (move_helper_bot_patient hbot1 reception corridor1 patient2)
   deleted: (at hbot1 reception) (at patient2 reception)
   added: (at hbot1 corridor1) (at patient2 corridor1)
   goals met: 2 of 8
34. (move_helper_bot_patient hbot1 corridor1 surgical_block patient2)
   deleted: (at hbot1 corridor1) (at patient2 corridor1)
   added: (at hbot1 surgical_block) (at patient2 surgical_block)
   goals met: 2 of 8
35. (move_helper_bot_patient hbot1 surgical_block cardiology_ward patient2)
   deleted: (at hbot1 surgical_block) (at patient2 surgical_block)
   added: (at hbot1 cardiology_ward) (at patient2 cardiology_ward)
   goals met: 2 of 8
36. (drop_down_patient hbot1 patient2)
   deleted: (helping_patient hbot1 patient2)
   added: (patient_on_ground patient2) (bot_is_free hbot1)
   goals met: 2 of 8
37. (deliver_patient hbot1 patient2 cardiology_unit cardiology_ward)
   deleted: (needs_patient cardiology_unit patient2)
   added: (has_patient cardiology_unit patient2)
   goals met: 3 of 8
38. (move_worker_bot_with_3_boxes wbot1 carrier1 box1 box2 box3 central_warehouse corridor1)
   deleted: (at wbot1 central_warehouse) (at box1 central_warehouse) (at box2 central_warehouse) (at box3 central_warehouse)
   added: (at wbot1 corridor1) (at box1 corridor1) (at box2 corridor1) (at box3 corridor1)
   goals met: 3 of 8
39. (deliver_supply wbot2 box4 blood_bag neurology_ward neurology_unit)
   deleted: (supply_in_box blood_bag box4) (needs_supply neurology_unit blood_bag)
   added: (box_is_empty box4) (has_supply neurology_unit blood_bag)
   goals met: 4 of 8
40. (move_worker_bot_with_3_boxes wbot1 carrier1 box1 box2 box3 corridor1 reception)
   deleted: (at wbot1 corridor1) (at box1 corridor1) (at box2 corridor1) (at box3 corridor1)
   added: (at wbot1 reception) (at box1 reception) (at box2 reception) (at box3 reception)
   goals met: 4 of 8
41. (drop_down_3rd_box wbot1 carrier1 box1)
   deleted: (carrying_box carrier1 box1) (carrier_has_3 carrier1)
   added: (box_on_ground box1) (carrier_has_2 carrier1)
   goals met: 4 of 8
42. (deliver_supply wbot1 box1 surgical_mask reception triage_unit)
   deleted: (supply_in_box surgical_mask box1) (needs_supply triage_unit surgical_mask)
   added: (box_is_empty box1) (has_supply triage_unit surgical_mask)
   goals met: 5 of 8
43. (pick_up_3rd_box wbot1 carrier1 box1 reception)
   deleted: (box_on_ground box1) (carrier_has_2 carrier1)
   added: (carrying_box carrier1 box1) (carrier_has_3 carrier1)
   goals met: 5 of 8
44. (move_worker_bot_with_3_boxes wbot1 carrier1 box1 box2 box3 reception emergency_room)
   deleted: (at wbot1 reception) (at box1 reception) (at box2 reception) (at box3 reception)
   added: (at wbot1 emergency_room) (at box1 emergency_room) (at box2 emergency_room) (at box3 emergency_room)
   goals met: 5 of 8
45. (drop_down_3rd_box wbot1 carrier1 box2)
   deleted: (carrying_box carrier1 box2) (carrier_has_3 carrier1)
   added: (box_on_ground box2) (carrier_has_2 carrier1)
   goals met: 5 of 8
46. (drop_down_2nd_box wbot1 carrier1 box3)
   deleted: (carrying_box carrier1 box3) (carrier_has_2 carrier1)
   added: (box_on_ground box3) (carrier_has_1 carrier1)
   goals met: 5 of 8
47. (pick_up_1st_box wbot2 carrier2 box4 neurology_ward)
   deleted: (box_on_ground box4) (carrier_empty carrier2) (bot_is_free wbot2)
   added: (carrying_box carrier2 box4) (carrier_has_1 carrier2)
   goals met: 5 of 8
48. (move_worker_bot_with_1_box wbot2 carrier2 box4 neurology_ward diagnostic_lab)
   deleted: (at wbot2 neurology_ward) (at box4 neurology_ward)
   added: (at wbot2 diagnostic_lab) (at box4 diagnostic_lab)
   goals met: 5 of 8
49. (deliver_supply wbot1 box2 scalpel emergency_room trauma_unit)
   deleted: (supply_in_box scalpel box2) (needs_supply trauma_unit scalpel)
   added: (box_is_empty box2) (has_supply trauma_unit scalpel)
   goals met: 6 of 8
50. (deliver_supply wbot1 box3 defibrillator emergency_room resuscitation_unit)
   deleted: (supply_in_box defibrillator box3) (needs_supply resuscitation_unit defibrillator)
   added: (box_is_empty box3) (has_supply resuscitation_unit defibrillator)
   goals met: 7 of 8
51. (move_worker_bot_with_1_box wbot2 carrier2 box4 diagnostic_lab corridor1)
   deleted: (at wbot2 diagnostic_lab) (at box4 diagnostic_lab)
   added: (at wbot2 corridor1) (at box4 corridor1)
   goals met: 7 of 8
52. (move_worker_bot_with_1_box wbot2 carrier2 box4 corridor1 central_warehouse)
   deleted: (at wbot2 corridor1) (at box4 corridor1)
   added: (at wbot2 central_warehouse) (at box4 central_warehouse)
   goals met: 7 of 8
53. (drop_down_1st_box wbot2 carrier2 box4)
   deleted: (carrying_box carrier2 box4) (carrier_has_1 carrier2)
   added: (box_on_ground box4) (carrier_empty carrier2) (bot_is_free wbot2)
   goals met: 7 of 8
54. (fill_box wbot2 box4 stethoscope central_warehouse)
   deleted: (box_is_empty box4)
   added: (supply_in_box stethoscope box4)
   goals met: 7 of 8
55. (pick_up_1st_box wbot2 carrier2 box4 central_warehouse)
   deleted: (box_on_ground box4) (carrier_empty carrier2) (bot_is_free wbot2)
   added: (carrying_box carrier2 box4) (carrier_has_1 carrier2)
   goals met: 7 of 8
56. (move_worker_bot_with_1_box wbot2 carrier2 box4 central_warehouse corridor1)
   deleted: (at wbot2 central_warehouse) (at box4 central_warehouse)
   added: (at wbot2 corridor1) (at box4 corridor1)
   goals met: 7 of 8
57. (move_worker_bot_with_1_box wbot2 carrier2 box4 corridor1 surgical_block)
   deleted: (at wbot2 corridor1) (at box4 corridor1)
   added: (at wbot2 surgical_block) (at box4 surgical_block)
   goals met: 7 of 8
58. (move_worker_bot_with_1_box wbot2 carrier2 box4 surgical_block cardiology_ward)
   deleted: (at wbot2 surgical_block) (at box4 surgical_block)
   added: (at wbot2 cardiology_ward) (at box4 cardiology_ward)
   goals met: 7 of 8
59. (drop_down_1st_box wbot2 carrier2 box4)
   deleted: (carrying_box carrier2 box4) (carrier_has_1 carrier2)
   added: (box_on_ground box4) (carrier_empty carrier2) (bot_is_free wbot2)
   goals met: 7 of 8
60. (deliver_supply wbot2 box4 stethoscope cardiology_ward cardiology_unit)
   deleted: (supply_in_box stethoscope box4) (needs_supply cardiology_unit stethoscope)
   added: (box_is_empty box4) (has_supply cardiology_unit stethoscope)
   goals met: 8 of 8
